Netzpfuscher/VESC_GD32/STM32CubeIDE/Application/User/VESC/src/conf_general.c
  return status;
}

bool conf_general_erase_flash(uint32_t addr, uint32_t pages){

	HAL_FLASH_Unlock();

	uint32_t page_error = 0;
	FLASH_EraseInitTypeDef s_eraseinit;
	s_eraseinit.TypeErase   = FLASH_TYPEERASE_PAGES;
	s_eraseinit.PageAddress = addr;
	s_eraseinit.NbPages     = pages;
	HAL_FLASHEx_EraseGD(&s_eraseinit, &page_error);

	HAL_FLASH_Lock();

	return true;
}

bool conf_general_write_fl(uint32_t base, uint8_t * data, uint16_t size){
	uint32_t word;
	uint8_t byte=0;
	uint8_t * word_ptr = (uint8_t*)&word;
	uint32_t flash_incr=0;

	HAL_FLASH_Unlock();


	for (unsigned int i = 0;i < size;i++) {

		word_ptr[byte] = data[i];
		byte++;
		if(byte==4){
			byte=0;
			HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, base+(flash_incr*4), *((uint32_t*)word_ptr));
			word=0;
			flash_incr++;
		}
	}
	if(byte!=0){
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, base+(flash_incr*4), *((uint32_t*)word_ptr));
	}
	HAL_FLASH_Lock();
	return true;
}



uint16_t conf_general_write_code(int ind, uint32_t offset, uint8_t *data, uint32_t len) {
#ifdef USE_LISPBM
	if (ind == CODE_IND_LISP) {
		if((LISP_MEMORY+offset+len) > LISP_MEMORY_END) return 0;
		conf_general_write_fl(LISP_MEMORY + offset, data, len);
	}
#endif
	if (ind == CODE_IND_QML) {
		if((QML_MEMORY+offset+len) > QML_MEMORY_END) return 0;
		conf_general_write_fl(QML_MEMORY + offset, data, len);
	}
	return 1;
}

uint16_t conf_general_erase_code(int ind) {
#ifdef USE_LISPBM
	if (ind == CODE_IND_LISP) {
		//lispif_stop_lib();
		conf_general_erase_flash(LISP_MEMORY, LISP_PAGES);
	}
#endif
	if (ind == CODE_IND_QML){
		conf_general_erase_flash(QML_MEMORY, QML_PAGES);
	}
	return FLASH_COMPLETE;
}

uint8_t* conf_general_code_data(int ind) {
#ifdef USE_LISPBM
	if (ind == CODE_IND_LISP) {
		return (uint8_t*)LISP_MEMORY+8;
	}
#endif
	if (ind == CODE_IND_QML) {
		return (uint8_t*)QML_MEMORY+8;
	}
	return NULL;
}

uint32_t conf_general_code_size(int ind) {
	uint8_t *base = NULL;
	int32_t index = 0;
#ifdef USE_LISPBM
	if (ind == CODE_IND_LISP) {
		base = (uint8_t*)LISP_MEMORY;
	}
#endif
	if (ind == CODE_IND_QML) {
		base = (uint8_t*)QML_MEMORY;
	}
	return buffer_get_uint32(base, &index);
}
